#include "reg52.h"
#include "public.h"
#include "mode.h"

/*******************************************************************************
* 函 数 名      : mode
* 函数功能		   : 选择模式，手动弹奏还是自动播放
* 输    入       : 无
* 输    出    	 : FY，选择的模式，为0时弹奏模式，为1时播放模式
*******************************************************************************/

u16 mode()
{
		u16 FY=2;
		if(key1==0){
				delay_ms(20);while(key1==0);delay_ms(20);//消抖
				FY = 0;
		}	
		else if(key2==0){
				delay_ms(20);while(key2==0);delay_ms(20);//消抖 
				FY = 1;	
		}			
		return FY;
}
